[
	{
		"name": "$01",
		"ident": 0,
		"order": 1,
		"desc": "A facility whose primary purpose is education.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$03",
		"ident": 1,
		"order": 2,
		"desc": "A facility or location whose primary purpose is to provide temporary housing to homeless individuals (e.g., emergency shelters, individual or family shelters).",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$04",
		"ident": 2,
		"order": 3,
		"desc": "A facility or location, owned and operated by the Indian Health Service, which provides diagnostic, therapeutic (surgical and nonsurgical), and rehabilitation services to American Indians and Alaska Natives who do not require hospitalization.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$05",
		"ident": 3,
		"order": 4,
		"desc": "A facility or location, owned and operated by the Indian Health Service, which provides diagnostic, therapeutic (surgical and nonsurgical), and rehabilitation services rendered by, or under the supervision of, physicians to American Indians and Alaska Natives admitted as inpatients or outpatients.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$06",
		"ident": 4,
		"order": 5,
		"desc": "A facility or location owned and operated by a federally recognized American Indian or Alaska Native tribe or tribal organization under a 638 agreement, which provides diagnostic, therapeutic (surgical and nonsurgical), and rehabilitation services to tribal members who do not require hospitalization.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$07",
		"ident": 5,
		"order": 6,
		"desc": "A facility or location owned and operated by a federally recognized American Indian or Alaska Native tribe or tribal organization under a 638 agreement, which provides diagnostic, therapeutic (surgical and nonsurgical), and rehabilitation services to tribal members admitted as inpatients or outpatients.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$08",
		"ident": 6,
		"order": 7,
		"desc": "A prison, jail, reformatory, work farm, detention center, or any other similar facility maintained by either Federal, State or local authorities for the purpose of confinement or rehabilitation of adult or juvenile criminal offenders.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$09",
		"ident": 7,
		"order": 8,
		"desc": "Location, other than a hospital, skilled nursing facility (SNF), military treatment facility, community health center, State or local public health clinic, or intermediate care facility (ICF), where the health professional routinely provides health examinations, diagnosis, and treatment of illness or injury on an ambulatory basis.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$11",
		"ident": 8,
		"order": 9,
		"desc": "Location, other than a hospital or other facility, where the patient receives care in a private residence.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$12",
		"ident": 9,
		"order": 10,
		"desc": "Congregate residential facility with self-contained living units providing assessment of each resident's needs and on-site support 24 hours a day, 7 days a week, with the capacity to deliver or arrange for services including some health care and other services.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$13",
		"ident": 10,
		"order": 11,
		"desc": "A residence, with shared living areas, where clients receive supervision and other services such as social and/or behavioral services, custodial service, and minimal services (e.g., medication administration).",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$14",
		"ident": 11,
		"order": 12,
		"desc": "A facility/unit that moves from place-to-place equipped to provide preventive, screening, diagnostic, and/or treatment services.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$15",
		"ident": 12,
		"order": 13,
		"desc": "portion of an off-campus hospital provider based department which provides diagnostic, therapeutic (both surgical and nonsurgical), and rehabilitation services to sick or injured persons who do not require hospitalization or institutionalization.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$19",
		"ident": 13,
		"order": 14,
		"desc": "Location, distinct from a hospital emergency room, an office, or a clinic, whose purpose is to diagnose and treat illness or injury for unscheduled, ambulatory patients seeking immediate medical attention.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$20",
		"ident": 14,
		"order": 15,
		"desc": "A facility, other than psychiatric, which primarily provides diagnostic, therapeutic (both surgical and nonsurgical), and rehabilitation services by, or under, the supervision of physicians to patients admitted for a variety of medical conditions.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$21",
		"ident": 15,
		"order": 16,
		"desc": "A land vehicle specifically designed, equipped and staffed for lifesaving and transporting the sick or injured.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$41",
		"ident": 16,
		"order": 17,
		"pvardefs": [

		],
		"lvardefs": [

		]
	}
]
