[
	{
		"name": "$treatment",
		"ident": 0,
		"order": 1,
		"desc": "One or more interventions are being assessed for preventing the development of a specific disease or health condition.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$prevention",
		"ident": 1,
		"order": 2,
		"desc": "One or more interventions are being evaluated for identifying a disease or health condition.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$diagnostic",
		"ident": 2,
		"order": 3,
		"desc": "One or more interventions are evaluated for maximizing comfort, minimizing side effects, or mitigating against a decline in the participant's health or function.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$supportive-care",
		"ident": 3,
		"order": 4,
		"desc": "One or more interventions are assessed or examined for identifying a condition, or risk factors for a condition, in people who are not yet known to have the condition or risk factor.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$screening",
		"ident": 4,
		"order": 5,
		"desc": "One or more interventions for evaluating the delivery, processes, management, organization, or financing of healthcare.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$health-services-research",
		"ident": 5,
		"order": 6,
		"desc": "One or more interventions for examining the basic mechanism of action (for example, physiology or biomechanics of an intervention).",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$basic-science",
		"ident": 6,
		"order": 7,
		"desc": "An intervention of a device product is being evaluated to determine the feasibility of the product or to test a prototype device and not health outcomes. Such studies are conducted to confirm the design and operating specifications of a device before beginning a full clinical trial.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$device-feasibility",
		"ident": 7,
		"order": 8,
		"pvardefs": [

		],
		"lvardefs": [

		]
	}
]
