[
	{
		"name": "$draft",
		"ident": 0,
		"order": 1,
		"desc": "This content has been subject to review and production implementation in a wide variety of environments. The content is considered to be stable and has been 'locked', subjecting it to FHIR Inter-version Compatibility Rules. While changes are possible, they are expected to be infrequent and are tightly constrained. Compatibility Rules.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$normative",
		"ident": 1,
		"order": 2,
		"desc": "This content has been well reviewed and is considered by the authors to be ready for use in production systems. It has been subjected to ballot and approved as an official standard. However, it has not yet seen widespread use in production across the full spectrum of environments it is intended to be used in. In some cases, there may be documented known issues that require implementation experience to determine appropriate resolutions for.\n\nFuture versions of FHIR may make significant changes to Trial Use content that are not compatible with previously published content.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$trial-use",
		"ident": 2,
		"order": 3,
		"desc": "This portion of the specification is provided for implementer assistance, and does not make rules that implementers are required to follow. Typical examples of this content in the FHIR specification are tables of contents, registries, examples, and implementer advice.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$informative",
		"ident": 3,
		"order": 4,
		"desc": "This portion of the specification is provided for implementer assistance, and does not make rules that implementers are required to follow. Typical examples of this content in the FHIR specification are tables of contents, registries, examples, and implementer advice.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$deprecated",
		"ident": 4,
		"order": 5,
		"desc": "This is content that is managed outside the FHIR Specification, but included for implementer convenience.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$external",
		"ident": 5,
		"order": 6,
		"pvardefs": [

		],
		"lvardefs": [

		]
	}
]
