[
	{
		"name": "$consent",
		"ident": 0,
		"order": 1,
		"desc": "A request that care of a particular type be provided to a patient.  Could involve the transfer of care, a consult, etc.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$referral",
		"ident": 1,
		"order": 2,
		"desc": "An undesired reaction caused by exposure to some agent (e.g. a medication, immunization, food, or environmental agent).",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$advevent",
		"ident": 2,
		"order": 3,
		"desc": "A request that a time be scheduled for a type of service for a specified patient, potentially subject to other constraints",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$aptmtreq",
		"ident": 3,
		"order": 4,
		"desc": "The transition of a patient or set of material from one location to another",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$transfer",
		"ident": 4,
		"order": 5,
		"desc": "The specification of a set of food and/or other nutritional material to be delivered to a patient.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$diet",
		"ident": 5,
		"order": 6,
		"desc": "An occurrence of a non-care-related event in the healthcare domain, such as approvals, reviews, etc.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$adminact",
		"ident": 6,
		"order": 7,
		"desc": "Record of a situation where a subject was exposed to a substance.  Usually of interest to public health.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$exposure",
		"ident": 7,
		"order": 8,
		"desc": "A formalized inquiry into the circumstances surrounding a particular unplanned event or potential event for the purposes of identifying possible causes and contributing factors for the event",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$investigation",
		"ident": 8,
		"order": 9,
		"desc": "A financial instrument used to track costs, charges or other amounts.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$account",
		"ident": 9,
		"order": 10,
		"desc": "A request for payment for goods and/or services.  Includes the idea of a healthcare insurance claim.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$invoice",
		"ident": 10,
		"order": 11,
		"desc": "The determination of what will be paid against a particular invoice based on coverage, plan rules, etc.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$adjudicat",
		"ident": 11,
		"order": 12,
		"desc": "A request for a pre-determination of the cost that would be paid under an insurance plan for a hypothetical claim for goods or services",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$predetreq",
		"ident": 12,
		"order": 13,
		"desc": "An adjudication of what would be paid under an insurance plan for a hypothetical claim for goods or services",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$predetermine",
		"ident": 13,
		"order": 14,
		"desc": "An investigation to determine information about a particular therapy or product",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$study",
		"ident": 14,
		"order": 15,
		"desc": "A set of (possibly conditional) steps to be taken to achieve some aim.  Includes study protocols, treatment protocols, emergency protocols, etc.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$protocol",
		"ident": 15,
		"order": 16,
		"pvardefs": [

		],
		"lvardefs": [

		]
	}
]
