[
	{
		"name": "$active",
		"ident": 0,
		"order": 1,
		"desc": "Actions implied by the prescription are to be temporarily halted, but are expected to continue later.  May also be called 'suspended'.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$on-hold",
		"ident": 1,
		"order": 2,
		"desc": "The prescription has been withdrawn before any administrations have occurred",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$cancelled",
		"ident": 2,
		"order": 3,
		"desc": "All actions that are implied by the prescription have occurred.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$completed",
		"ident": 3,
		"order": 4,
		"desc": "Some of the actions that are implied by the medication request may have occurred.  For example, the medication may have been dispensed and the patient may have taken some of the medication.  Clinical decision support systems should take this status into account",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$entered-in-error",
		"ident": 4,
		"order": 5,
		"desc": "Actions implied by the prescription are to be permanently halted, before all of the administrations occurred. This should not be used if the original order was entered in error",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$stopped",
		"ident": 5,
		"order": 6,
		"desc": "The prescription is not yet 'actionable', e.g. it is a work in progress, requires sign-off, verification or needs to be run through decision support process.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$draft",
		"ident": 6,
		"order": 7,
		"desc": "The authoring/source system does not know which of the status values currently applies for this observation. Note: This concept is not to be used for 'other' - one of the listed statuses is presumed to apply, but the authoring/source system does not know which.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$unknown",
		"ident": 7,
		"order": 8,
		"pvardefs": [

		],
		"lvardefs": [

		]
	}
]
