{
	"classtype": "kObjectclass",
	"internalversion": 3,
	"superclass": "fhir.FHIRBaseElement",
	"designtaskname": "",
	"cvardefs": [
		{
			"name": "cElements",
			"order": 1,
			"type": "kList",
			"subtype": "",
			"sublen": 0
		},
		{
			"name": "cElementsInited",
			"order": 2,
			"type": "kBoolean",
			"subtype": 0,
			"sublen": 0
		}
	],
	"ivardefs": [
		{
			"name": "color",
			"order": 8,
			"type": "kList",
			"subtype": "",
			"sublen": 0
		},
		{
			"name": "color_",
			"order": 9,
			"type": "kCharacter",
			"subtype": "kSimplechar",
			"sublen": 100000000,
			"desc": "Where applicable, the color can be specified An appropriate controlled vocabulary shall be used The term and the term identifier shall be used."
		},
		{
			"name": "depth",
			"order": 3,
			"type": "kObjectref",
			"subtype": "oQuantity",
			"sublen": 0,
			"desc": "Where applicable, the depth can be specified using a numerical value and its unit of measurement The unit of measurement shall be specified in accordance with ISO 11240 and the resulting terminology The symbol and the symbol identifier shall be used."
		},
		{
			"name": "externalDiameter",
			"order": 6,
			"type": "kObjectref",
			"subtype": "oQuantity",
			"sublen": 0,
			"desc": "Where applicable, the external diameter can be specified using a numerical value and its unit of measurement The unit of measurement shall be specified in accordance with ISO 11240 and the resulting terminology The symbol and the symbol identifier shall b"
		},
		{
			"name": "height",
			"order": 1,
			"type": "kObjectref",
			"subtype": "oQuantity",
			"sublen": 0,
			"desc": "Where applicable, the height can be specified using a numerical value and its unit of measurement The unit of measurement shall be specified in accordance with ISO 11240 and the resulting terminology The symbol and the symbol identifier shall be used."
		},
		{
			"name": "image",
			"order": 12,
			"type": "kList",
			"subtype": "",
			"sublen": 0
		},
		{
			"name": "image_",
			"order": 13,
			"type": "kObjectref",
			"subtype": "oAttachment",
			"sublen": 0,
			"desc": "Where applicable, the image can be provided The format of the image attachment shall be specified by regional implementations."
		},
		{
			"name": "imprint",
			"order": 10,
			"type": "kList",
			"subtype": "",
			"sublen": 0
		},
		{
			"name": "imprint_",
			"order": 11,
			"type": "kCharacter",
			"subtype": "kSimplechar",
			"sublen": 100000000,
			"desc": "Where applicable, the imprint can be specified as text."
		},
		{
			"name": "nominalVolume",
			"order": 5,
			"type": "kObjectref",
			"subtype": "oQuantity",
			"sublen": 0,
			"desc": "Where applicable, the nominal volume can be specified using a numerical value and its unit of measurement The unit of measurement shall be specified in accordance with ISO 11240 and the resulting terminology The symbol and the symbol identifier shall be u"
		},
		{
			"name": "scoring",
			"order": 14,
			"type": "kObjectref",
			"subtype": "oCodeableConcept",
			"sublen": 0,
			"desc": "Where applicable, the scoring can be specified An appropriate controlled vocabulary shall be used The term and the term identifier shall be used."
		},
		{
			"name": "shape",
			"order": 7,
			"type": "kCharacter",
			"subtype": "kSimplechar",
			"sublen": 100000000,
			"desc": "Where applicable, the shape can be specified An appropriate controlled vocabulary shall be used The term and the term identifier shall be used."
		},
		{
			"name": "weight",
			"order": 4,
			"type": "kObjectref",
			"subtype": "oQuantity",
			"sublen": 0,
			"desc": "Where applicable, the weight can be specified using a numerical value and its unit of measurement The unit of measurement shall be specified in accordance with ISO 11240 and the resulting terminology The symbol and the symbol identifier shall be used."
		},
		{
			"name": "width",
			"order": 2,
			"type": "kObjectref",
			"subtype": "oQuantity",
			"sublen": 0,
			"desc": "Where applicable, the width can be specified using a numerical value and its unit of measurement The unit of measurement shall be specified in accordance with ISO 11240 and the resulting terminology The symbol and the symbol identifier shall be used."
		}
	],
	"properties": {
		"collectperformancedata": false,
		"componenticon": 0,
		"componenttype": "kCompStoreHidden",
		"createdate": "2020-06-01 17:44:32",
		"desc": "Base StructureDefinition for ProdCharacteristic Type: The marketing status describes the date when a medicinal product is actually put on the market or the date as of which it is no longer available.",
		"editor": "",
		"editordata": "",
		"external": true,
		"issupercomponent": false,
		"moddate": "2020-06-01 17:57:28",
		"selfcontained": false,
		"showascheckedout": false,
		"userinfo": "",
		"version": ""
	}
}
