[
	{
		"name": "$metadata",
		"ident": 0,
		"order": 1,
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$setupMetadata",
		"ident": 1,
		"order": 2,
		"pvardefs": [
			{
				"name": "pElements",
				"order": 1,
				"type": "kFieldreference",
				"subtype": 0,
				"sublen": 0,
				"param": 1
			}
		],
		"lvardefs": [

		]
	},
	{
		"name": "$construct",
		"ident": 2,
		"order": 3,
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$copyFrom",
		"ident": 3,
		"order": 4,
		"pvardefs": [

		],
		"lvardefs": [
			{
				"name": "itemRef",
				"order": 2,
				"type": "kItemref",
				"subtype": "",
				"sublen": 0
			},
			{
				"name": "list",
				"order": 1,
				"type": "kList",
				"subtype": "",
				"sublen": 0
			}
		]
	},
	{
		"name": "$code",
		"ident": 4,
		"order": 5,
		"desc": "Returns: Indicates a meaning for the supplemental data. This can be as simple as a unique identifier, or it can establish meaning in a broader context by drawing from a terminology, allowing supplemental data to be correlated across measures.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$code.$assign",
		"ident": 5,
		"order": 6,
		"pvardefs": [
			{
				"name": "pValue",
				"order": 1,
				"type": "kObjectref",
				"subtype": "oCodeableConcept",
				"sublen": 0,
				"param": 1,
				"desc": "Indicates a meaning for the supplemental data. This can be as simple as a unique identifier, or it can establish meaning in a broader context by drawing from a terminology, allowing supplemental data to be correlated across measures."
			}
		],
		"lvardefs": [

		]
	},
	{
		"name": "$usage",
		"ident": 6,
		"order": 7,
		"desc": "Returns: An indicator of the intended usage for the supplemental data element. Supplemental data indicates the data is additional information requested to augment the measure information. Risk adjustment factor indicates the data is additional information used to calculate risk adjustment factors when applying a risk model to the measure calculation.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$addusage",
		"ident": 7,
		"order": 8,
		"desc": "An indicator of the intended usage for the supplemental data element. Supplemental data indicates the data is additional information requested to augment the measure information. Risk adjustment factor indicates the data is additional information used to calculate risk adjustment factors when applying a risk model to the measure calculation.",
		"pvardefs": [
			{
				"name": "pValue",
				"order": 1,
				"type": "kObjectref",
				"subtype": "oCodeableConcept",
				"sublen": 0,
				"param": 1
			}
		],
		"lvardefs": [
			{
				"name": "objRef",
				"order": 2,
				"type": "kObjectref",
				"subtype": "oCodeableConcept",
				"sublen": 0,
				"desc": "An indicator of the intended usage for the supplemental data element. Supplemental data indicates the data is additional information requested to augment the measure information. Risk adjustment factor indicates the data is additional information used to "
			}
		]
	},
	{
		"name": "$description",
		"ident": 8,
		"order": 9,
		"desc": "Returns: The human readable description of this supplemental data.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$description.$assign",
		"ident": 9,
		"order": 10,
		"pvardefs": [
			{
				"name": "pValue",
				"order": 1,
				"type": "kCharacter",
				"subtype": "kSimplechar",
				"sublen": 100000000,
				"param": 1,
				"desc": "The human readable description of this supplemental data."
			}
		],
		"lvardefs": [

		]
	},
	{
		"name": "$criteria",
		"ident": 10,
		"order": 11,
		"desc": "Returns: The criteria for the supplemental data. This is typically the name of a valid expression defined within a referenced library, but it may also be a path to a specific data element. The criteria defines the data to be returned for this element.",
		"pvardefs": [

		],
		"lvardefs": [

		]
	},
	{
		"name": "$criteria.$assign",
		"ident": 11,
		"order": 12,
		"pvardefs": [
			{
				"name": "pValue",
				"order": 1,
				"type": "kObjectref",
				"subtype": "oExpression",
				"sublen": 0,
				"param": 1,
				"desc": "The criteria for the supplemental data. This is typically the name of a valid expression defined within a referenced library, but it may also be a path to a specific data element. The criteria defines the data to be returned for this element."
			}
		],
		"lvardefs": [

		]
	}
]
